#Задача 1

#y= [98, 35, 42, 21, 29, 309, 46]
#print(y)
#summ = 0
#for i in range(1, len(y), 2):
#    if i % 2 == 1:
#        summ += y[i]       
#print(f"{y} -> Cумма элементов на нечётных позициях: {summ}")

#Задача 2

#def mult_lst(lst):
#    l = len(lst)//2 + 1 if len(lst) % 2 != 0 else len(lst)//2
#    = = [lst[i]*lst[len(lst)-i-1] for i in range (l)]
#    print(new_lst)

#= = [2, 3, 4, 5, 6]
#mult_lst(lst)
#lst = list(map(int, input("Введите числа через пробел:\n").split()))
#mult_lst(lst)

#Задача 3

#n = int(input('Введите значение числа "а": ')) 
#a = ''
#while n > 0:
#    a = str(n % 2) + a
#    n = n // 2
#print(f'число "а" в двоичной системе: {a}')
